const textRegExp = new RegExp(/^^[A-ZА-Я][а-яА-ЯёЁa-zA-Z]+$/i); 
const numberRegExp = new RegExp(/^[0-9]*$/);
const emailRegExp = (/^\w+([\.-]?\w+)*@\w+([\.-]?\w+)*(\.\w{2,3})+$/);
const dateRegExp = new RegExp(['^(?:(?:(?:0?[13578]|1[02])(\\/|-|\\.)31)',
    '\\1|(?:(?:0?[1,3-9]|1[0-2])(\\/|-|\\.)(?:29|30)',
    '\\2))(?:(?:1[6-9]|[2-9]\\d)?\d{2})$|^(?:0?2(\\/|-|\\.)',
    '29\\3(?:(?:(?:1[6-9]|[2-9]\\d)?(?:0[48]|[2468][048]|',
    '[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))',
    '$|^(?:(?:0?[1-9])|(?:1[0-2]))(\\/|-|\\.)',
    '(?:0?[1-9]|1\\d|2[0-8])\\4',
    '(?:(?:1[6-9]|[2-9]\\d)?\\d{2})$'].join(''), "g");
const passportRegExp =  new RegExp(/^(?!^0+$)[a-zA-Z0-9]{3,20}$/);

export {
    textRegExp,
    numberRegExp,
    emailRegExp,
    dateRegExp,
    passportRegExp
}